## Plan Result (826: deploy - PlanAndApply)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azuread_access_package.package[&#34;Database - Special Tribunals read access - self approval&#34;]
  * azuread_access_package_assignment_policy.this[&#34;Database-self-approval-with-justification:Database - Special Tribunals read access - self approval&#34;]
  * azuread_access_package_resource_catalog_association.this[&#34;Databases:DTS JIT Access sptribs DB Reader SC&#34;]
  * azuread_access_package_resource_package_association.this[&#34;Database - Special Tribunals read access - self approval:Databases:DTS JIT Access sptribs DB Reader SC&#34;]
  * azuread_access_package_resource_package_association.this[&#34;Database - Special Tribunals read access - self approval:Databases:DTS Production Bastion Access for Users (DevOps)&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azuread_access_package.package["Database - Special Tribunals read access - self approval"] will be created
  + resource "azuread_access_package" "package" {
      + catalog_id   = "87fef47f-7b35-41f7-9519-0bd5ce5c60d3"
      + description  = "Grants read access to Special Tribunals databases"
      + display_name = "Database - Special Tribunals read access - self approval"
      + hidden       = false
      + id           = (known after apply)
    }

  # azuread_access_package_assignment_policy.this["Database-self-approval-with-justification:Database - Special Tribunals read access - self approval"] will be created
  + resource "azuread_access_package_assignment_policy" "this" {
      + access_package_id = (known after apply)
      + description       = "Initial Policy"
      + display_name      = "Initial Policy"
      + duration_in_days  = 1
      + extension_enabled = true
      + id                = (known after apply)

      + approval_settings {
          + approval_required                = false
          + approval_required_for_extension  = false
          + requestor_justification_required = true
        }

      + question {
          + required = true
          + sequence = 0

          + text {
              + default_text = "Jira link"
            }
        }

      + requestor_settings {
          + requests_accepted = true
          + scope_type        = "SpecificDirectorySubjects"

          + requestor {
              + object_id    = "6029ab89-9151-4566-bea0-b89a6249a6f3"
              + subject_type = "groupMembers"
            }
        }
    }

  # azuread_access_package_resource_catalog_association.this["Databases:DTS JIT Access sptribs DB Reader SC"] will be created
  + resource "azuread_access_package_resource_catalog_association" "this" {
      + catalog_id             = "87fef47f-7b35-41f7-9519-0bd5ce5c60d3"
      + id                     = (known after apply)
      + resource_origin_id     = "6187488b-e053-4805-aa58-10b7c87f3900"
      + resource_origin_system = "AadGroup"
    }

  # azuread_access_package_resource_package_association.this["Database - Special Tribunals read access - self approval:Databases:DTS JIT Access sptribs DB Reader SC"] will be created
  + resource "azuread_access_package_resource_package_association" "this" {
      + access_package_id               = (known after apply)
      + access_type                     = "Member"
      + catalog_resource_association_id = (known after apply)
      + id                              = (known after apply)
    }

  # azuread_access_package_resource_package_association.this["Database - Special Tribunals read access - self approval:Databases:DTS Production Bastion Access for Users (DevOps)"] will be created
  + resource "azuread_access_package_resource_package_association" "this" {
      + access_package_id               = (known after apply)
      + access_type                     = "Member"
      + catalog_resource_association_id = "87fef47f-7b35-41f7-9519-0bd5ce5c60d3/ae14273d-d90a-4f3e-a8b6-f6df6e3dce01"
      + id                              = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":102,"Program":"tfcmt","SHA1":"","Target":"826: deploy - PlanAndApply","Vars":{}} -->